Initial commit screeshots and docs upd: DoConnect AI
